{
  "downloaded_at": "2025-11-30T15:46:41.014849",
  "edition_date": "202511",
  "source_url": "https://www.federalreserve.gov/monetarypolicy/beigebook202511-summary.htm",
  "title": "HTML",
  "content": "ï»¿\nThe Fed - Monetary Policy: Beige Book (Branch)\nSkip to main content\nAn official website of the United States Government\nHere's how you know\nOfficial websites use .gov\nA\n.gov\nwebsite belongs to an official government organization in the United States.\nSecure .gov websites use HTTPS\nA\nlock\n(\nLock\nLocked padlock icon\n) or\nhttps://\nmeans you've safely connected to the .gov website. Share sensitive information only on official, secure websites.\nBack to Home\nBoard of Governors of the Federal Reserve System\nStay Connected\nFederal Reserve Facebook Page\nFederal Reserve Instagram Page\nFederal Reserve YouTube Page\nFederal Reserve Flickr Page\nFederal Reserve LinkedIn Page\nFederal Reserve Threads Page\nFederal Reserve X Page\nFederal Reserve Bluesky Page\nSubscribe to RSS\nSubscribe to Email\nRecent Postings\nCalendar\nPublications\nSite Map\nA-Z index\nCareers\nFAQs\nVideos\nContact\nSearch\nSubmit Search Button\nAdvanced\nToggle Dropdown Menu\nBoard of Governors of the Federal Reserve System\nThe Federal Reserve, the central bank of the United States, provides\r\n          the nation with a safe, flexible, and stable monetary and financial\r\n          system.\nMain Menu Toggle Button\nSections\nSearch Toggle Button\nSearch\nSearch Submit Button\nSubmit\nAbout\nthe Fed\nStructure of the Federal Reserve System\nThe Fed Explained\nBoard Members\nAdvisory Councils\nFederal Reserve Banks\nFederal Reserve Bank and Branch Directors\nFederal Reserve Act\nCurrency\nBoard Meetings\nBoard Votes\nCareers\nDo Business with the Board\nHolidays Observed - K.8\nEthics & Values\nContact\nRequesting Information (FOIA)\nFAQs\nEconomic Education\nFed Financial Statements\nFinancial Innovation\nNews\n& Events\nPress Releases\nSpeeches\nTestimony\nCalendar\nVideos\nPhoto Gallery\nConferences\nMonetary\nPolicy\nFederal Open Market Committee\nAbout the FOMC\nMeeting calendars and information\nTranscripts and other historical materials\nFAQs\nMonetary Policy Principles and Practice\nNotes\nPolicy Implementation\nPolicy Normalization\nPolicy Tools\nReports\nMonetary Policy Report\nBeige Book\nFederal Reserve Balance Sheet Developments\nReview of Monetary Policy Strategy, Tools, and Communications\nOverview\nSupervision\n& Regulation\nInstitution Supervision\nCommunity & Regional Financial Institutions\nLarge Financial Institutions\nForeign Banking Organizations\nFinancial Market Utilities\nConsumer Compliance\nState Member Banks Supervised by the Federal Reserve\nReports\nFederal Reserve Supervision and Regulation Report\nReporting Forms\nAll Reporting Forms\nRecent Updates\nInformation collections under review\nFinancial Statements\nApplications/structure change\nFederal Financial Institutions Examination Council (FFIEC)\nMunicipal & Government Securities\nSupervision & Regulation Letters\nBy Year\nBy Topic\nBanking Applications & Legal Developments\nApplication Process\nBoard & Reserve Bank Action\nEnforcement Actions & Legal Developments\nRegulatory Resources\nRegulations\nManuals\nBasel Regulatory Framework\nVolcker Rule\nEducation, Training, and Assistance\nBanking & Data Structure\nBeneficial Ownership reports\nLarge Commercial Banks\nU.S. Offices of Foreign Entities\nFinancial Holding Companies\nInterstate Branching\nSecurities Underwriting & Dealing Subsidiaries\nMinority Depository Institutions\nFinancial\nStability\nFinancial Stability Assessments\nAbout Financial Stability\nTypes of Financial System Vulnerabilities & Risks\nMonitoring Risk Across the Financial System\nProactive Monitoring of Markets & Institutions\nFinancial Stability & Stress Testing\nFinancial Stability Coordination & Actions\nResponding to Financial System Emergencies\nCooperation on Financial Stability\nReports\nFinancial Stability Report\nPayment\nSystems\nRegulations & Statutes\nRegulation CC (Availability of Funds and Collection of Checks)\nRegulation II (Debit Card Interchange Fees and Routing)\nRegulation HH (Financial Market Utilities)\nOther Regulations and Statutes\nPayment Policies\nFederal Reserve's Key Policies for the Provision of Financial Services\nGuidelines for Evaluating Joint Account Requests\nOvernight Overdrafts\nPayment System Risk\nSponsorship for Priority Telecommunication Services\nReserve Bank Payment Services & Data\nAutomated Clearinghouse Services\nCheck Services\nCurrency and Coin Services\nDaylight Overdrafts and Fees\nFedNow\n®\nService\nFedwire Funds Services\nFedwire Securities Services\nFiscal Agency Services\nMaster Account and Services Database\nNational Settlement Service\nFinancial Market Utilities & Infrastructures\nSupervision & Oversight of Financial Market Infrastructures\nDesignated Financial Market Utilities\nInternational Standards for Financial Market Infrastructures\nResearch, Reports, & Committees\nFederal Reserve Payments Study (FRPS)\nPayments Research\nReports\nPayments System Policy Advisory Committee\nEconomic\nResearch\nMeet the Researchers\nWorking Papers and Notes\nFinance and Economics Discussion Series (FEDS)\nFEDS Notes\nInternational Finance Discussion Papers (IFDP)\nData, Models and Tools\nEconomic Research Data\nFRB/US Model\nEstimated Dynamic Optimization (EDO) Model\nSurvey of Consumer Finances (SCF)\nData\nData Download Program\nBank Assets and Liabilities\nAggregate Reserves of Depository Institutions and the Monetary Base - H.3\nAssets and Liabilities of Commercial Banks in the U.S. - H.8\nAssets and Liabilities of U.S. Branches and Agencies of Foreign Banks\nCharge-Off and Delinquency Rates on Loans and Leases at Commercial Banks\nSenior Financial Officer Survey\nSenior Loan Officer Opinion Survey on Bank Lending Practices\nBank Structure Data\nLarge Commercial Banks\nMinority Depository Institutions\nStructure and Share Data for the U.S. Offices of Foreign Banks\nBusiness Finance\nCommercial Paper\nFinance Companies - G.20\nNew Security Issues, State and Local Governments\nNew Security Issues, U.S. Corporations\nDealer Financing Terms\nSenior Credit Officer Opinion Survey on Dealer Financing Terms\nExchange Rates and International Data\nForeign Exchange Rates - H.10/G.5\nInternational Summary Statistics\nSecurities Holdings and Transactions\nStatistics Reported by Banks and Other Financial Firms in the United States\nStructure and Share Data for U.S. Offices of Foreign Banks\nFinancial Accounts\nFinancial Accounts of the United States - Z.1\nHousehold Finance\nConsumer Credit - G.19\nHousehold Debt Service Ratios\nMortgage Debt Outstanding\nSurvey of Consumer Finances (SCF)\nSurvey of Household Economics and Decisionmaking\nIndustrial Activity\nIndustrial Production and Capacity Utilization - G.17\nInterest Rates\nSelected Interest Rates - H.15\nMicro Data Reference Manual (MDRM)\nMicro and Macro Data Collections\nMoney Stock and Reserve Balances\nFactors Affecting Reserve Balances - H.4.1\nMoney Stock Measures - H.6\nOther\nYield Curve Models and Data\nConsumers\n& Communities\nRegulations\nCommunity Reinvestment Act (CRA)\nAll Regulations\nSupervisionÂ & Enforcement\nCA Letters\nEnforcement Actions\nIndependent Foreclosure Review\nCommunity Development\nHousing and Neighborhood Revitalization\nSmall Business and Entrepreneurship\nEmployment and Workforce Development\nCommunity Development Finance\nRural Community and Economic Development\nConferences\nResearchÂ & Analysis\nSurvey of Household Economics and Decisionmaking\nResearch Publications & Data Analysis\nCommunity Advisory Council\nResources for Consumers\nFrauds and Scams\nMortgage and Foreclosure Resources\nFederal Reserve Community Development Resources\nHome\nMonetary Policy\nBeige Book\nNovember 2025\nBeige Book - November 2025\nPDF\nAbout This Publication\nNational Summary\nFederal Reserve Bank of Boston\nFederal Reserve Bank of New York\nFederal Reserve Bank of Philadelphia\nFederal Reserve Bank of Cleveland\nFederal Reserve Bank of Richmond\nFederal Reserve Bank of Atlanta\nFederal Reserve Bank of Chicago\nFederal Reserve Bank of St. Louis\nFederal Reserve Bank of Minneapolis\nFederal Reserve Bank of Kansas City\nFederal Reserve Bank of Dallas\nFederal Reserve Bank of San Francisco\nNational Summary\nOverall Economic Activity\nEconomic activity was little changed since the previous report, according to most of the twelve Federal Reserve Districts, though two Districts noted a modest decline and one reported modest growth. Overall consumer spending declined further, while higher-end retail spending remained resilient. Some retailers noted a negative impact on consumer purchases from the government shutdown, and auto dealers saw declines in EV sales following the expiration of the federal tax credit. Reports of travel and tourism activity reflected little change in recent weeks, with some contacts noting cautious discretionary spending among consumers. Manufacturing activity increased somewhat, according to most Districts, though tariffs and tariff uncertainty remained a headwind. Revenues in the nonfinancial services sector were mostly flat to down, and reports of loan demand were mixed. Some Districts reported declines in residential construction, while others said it was unchanged, and home sales activity varied. A few Districts noted ongoing recovery in the office real estate market. Conditions in the agriculture and energy sectors were largely stable, though some contacts cited challenges from the low-price environment for oil and for some crops. Community organizations saw increased demand for food assistance, due in part to disruptions in SNAP benefits during the government shutdown. Outlooks were largely unchanged overall. Some contacts noted an increased risk of slower activity in coming months, while some optimism was noted among manufacturers.\nLabor Markets\nEmployment declined slightly over the current period with around half of Districts noting weaker labor demand. Despite an uptick in layoff announcements, more Districts reported contacts limiting headcounts using hiring freezes, replacement-only hiring, and attrition than through layoffs. In addition, several employers adjusted hours worked to accommodate higher or lower than expected business volume instead of adjusting the number of employees. A few firms noted that artificial intelligence replaced entry-level positions or made existing workers productive enough to curb new hiring. Across most Districts, employers had an easier time finding workers, but there were still pockets of difficulty related to certain skilled positions and fewer immigrant workers. Wages generally grew at a modest pace; however, some sectors such as manufacturing, construction, and health care experienced more moderate wage pressure because of a tighter labor supply. Furthermore, rising health insurance premiums continue to put upward pressure on labor costs.\nPrices\nPrices rose moderately during the reporting period. Input cost pressures were widespread in manufacturing and retail, largely reflecting tariff-induced increases. Some Districts noted rising costs for insurance, utilities, technology, and health care. The extent of passthrough of higher input costs to customers varied, and depended upon demand, competitive pressures, price sensitivity of consumers, and pushback from clients. There were multiple reports of margin compression or firms facing financial strain stemming from tariffs. Prices declined for certain materials, which firms attributed to sluggish demand, deferred tariff implementation, or reduced tariff rates. Looking ahead, contacts largely anticipate upward cost pressures to persist but plans to raise prices in the near term were mixed.\nHighlights by Federal Reserve District\nBoston\nEconomic activity expanded slightly, as home sales showed renewed strength. Consumer spending came in flat. Employment edged lower, with no major layoffs, and wages rose modestly. Grocery store prices rose at a moderate pace amid cost pressures on food commodities, although price increases in general were modest. The outlook was cautiously optimistic.\nNew York\nEconomic activity declined modestly. On balance, employment fell slightly with some layoffs occurring at major employers in the region. The pace of price increases eased slightly but remained elevated. Manufacturing activity increased moderately. Consumer spending declined slightly, though higher-end retail spending remained resilient. Businesses did not expect much improvement in the months ahead.\nPhiladelphia\nEconomic activity was already trending down when the government shutdown spurred further economic disruptionâ\u0080\u0094driving modest declines overall across most sectors. Employment levels also fell, and price pressures are stressing low- and middle-income households, while shifting government policies are stressing small businesses.\nCleveland\nFourth District business activity increased slightly in recent weeks, but contacts expected flat activity in the months ahead. Demand for professional and business services increased moderately. Manufacturing activity declined slightly, though some manufacturers reported a boost from AI data centers. Nonlabor cost growth remained robust, while selling prices increased moderately.\nRichmond\nThe regional economy continued to grow modestly in recent weeks. Consumer spending grew modestly despite some hesitation among consumers to make big-ticket purchases. Manufacturing activity contracted modestly while growth in the remaining industries was little changed. Employment levels were also little changed as employers kept headcounts at current levels and wage growth remained moderate. Price growth remained moderate, overall.\nAtlanta\nEconomic activity was little changed, on balance. Employment levels remained flat, and wages and prices grew modestly. Retail sales slowed, and overall travel activity was flat to slightly down. Home sales declined, but commercial real estate improved somewhat. Transportation and manufacturing activity were mostly flat. Demand for energy grew moderately.\nChicago\nEconomic activity in the Seventh District rose slightly. Employment, consumer spending, business spending, construction and real estate, and manufacturing all increased slightly. Prices rose moderately, wages were up modestly, and financial conditions loosened some. Prospects for 2025 farm income rose slightly.\nSt. Louis\nEconomic activity and employment levels have remained unchanged since our previous report, with contacts continuing to report a slowdown in demand amplified by the federal government shutdown. Prices have increased moderately, with contacts expecting price growth to increase over the next six months. The outlook has slightly deteriorated and can be described as pessimistic because of increased risks of higher prices and slower activity.\nMinneapolis\nActivity was flat on balance. Employers reported a marginal reduction in head counts and modest improvement in labor availability. Price pressures increased. New vehicle sales rose but consumer spending fell overall. Manufacturing, home sales, and commercial construction increased, while most other sectors were flat. Despite strong harvests, agricultural conditions remained weak.\nKansas City\nEconomic growth in the Tenth District slowed slightly, reflecting softer labor conditions and cooling consumer activity. Wage increases were in line with cost-of-living adjustments, as demand for labor was in balance with supply. Although prices continue to increase modestly, most firms are passing through only 20 percent of increased input costs. Firms remain optimistic about employment growth over the next six months.\nDallas\nEconomic activity weakened slightly. Declines were seen in nonfinancial services, retail, and banking. Weakness continued in the housing market, and energy activity was flat. The manufacturing sector remained resilient, however, with production growth continuing at a modest pace. Employment fell on net, and prices increased moderately. Outlooks generally worsened, with contacts citing an economic slowdown, tariff concerns, interest rates, and heightened uncertainty.\nSan Francisco\nEconomic conditions were mixed over the reporting period. Employment levels largely held steady, wages rose somewhat, and prices were up modestly. Activity in retail trade, agriculture, and residential real estate eased slightly while activity in services, manufacturing, and commercial real estate remained largely unchanged on balance. Lending activity strengthened marginally.\nNote: This report was prepared at the Federal Reserve Bank of Dallas based on information collected on or before November 17, 2025. This document summarizes comments received from contacts outside the Federal Reserve System and is not a commentary on the views of Federal Reserve officials.\nBack to Top\nLast Update:\r\n                    November 26, 2025\nBoard of Governors\nof the\nFederal Reserve System\nAbout the Fed\nNews & Events\nMonetary Policy\nSupervision & Regulation\nFinancial Stability\nPayment Systems\nEconomic Research\nData\nConsumers & Communities\nConnect with the Board\nTools and Information\nContact\nPublications\nFreedom of Information (FOIA)\nOffice of Inspector General\nBudget & Performance\n|\nAudit\nNo FEAR Act\nEspañol\nWebsite Policies\n|\nPrivacy Program\nAccessibility\nStay Connected\nFederal Reserve Facebook Page\nFederal Reserve Instagram Page\nFederal Reserve YouTube Page\nFederal Reserve Flickr Page\nFederal Reserve LinkedIn Page\nFederal Reserve Threads Page\nLink to Federal Reserve X Page\nLink to Federal Reserve Bluesky Page\nSubscribe to RSS\nSubscribe to Email\nBoard of Governors\nof the\nFederal Reserve System\n20th Street and Constitution Avenue N.W., Washington, DC 20551",
  "available_editions": [
    {
      "date": "202511",
      "url": "https://www.federalreserve.gov/monetarypolicy/beigebook202511-summary.htm",
      "title": "HTML"
    },
    {
      "date": "202510",
      "url": "https://www.federalreserve.gov/monetarypolicy/beigebook202510-summary.htm",
      "title": "HTML"
    },
    {
      "date": "202508",
      "url": "https://www.federalreserve.gov/monetarypolicy/beigebook202508-summary.htm",
      "title": "HTML"
    },
    {
      "date": "202507",
      "url": "https://www.federalreserve.gov/monetarypolicy/beigebook202507-summary.htm",
      "title": "HTML"
    },
    {
      "date": "202505",
      "url": "https://www.federalreserve.gov/monetarypolicy/beigebook202505-summary.htm",
      "title": "HTML"
    },
    {
      "date": "202504",
      "url": "https://www.federalreserve.gov/monetarypolicy/beigebook202504-summary.htm",
      "title": "HTML"
    },
    {
      "date": "202502",
      "url": "https://www.federalreserve.gov/monetarypolicy/beigebook202502-summary.htm",
      "title": "HTML"
    },
    {
      "date": "202501",
      "url": "https://www.federalreserve.gov/monetarypolicy/beigebook202501-summary.htm",
      "title": "HTML"
    }
  ]
}